
123456  INITIALIZE HELLO-WORLD
        IF KEY = '1' AND KEY NOT = '2' AND (B OR NOT C) THEN
            MOVE WS-HELLO-WORLD TO HELLO-WORLD
        END IF
        TABLE(STRUCT)
        HELLO-WORLD(1:1)
        PERFORM B001-A
      * PERFORM STRUCT