
        PERFORM STRUCT THRU HELLO-WORLD
        END-PERFORM.
        PERFORM STRUCT UNTIL COUNT=5
        PERFORM STRUCT WITH TEST BEFORE UNTIL COUNT=5
        PERFORM STRUCT WITH TEST AFTER UNTIL COUNT=5
        PERFORM STRUCT 5 TIMES
        PERFORM STRUCT VARYING HELLO-WORLD FROM 1 BY 1 UNTIL HELLO-WORLD=5
        GO TO STRUCT DEPENDING ON HELLO-WORLD.