
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRUCT.

       ENVIRONMENT DIVISION.
          SOURCE-COMPUTER. XXX-ZOS.
          OBJECT-COMPUTER. XXX-ZOS.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
          01 WS-HELLO-WORLD PIC X(9) VALUE 10 .
       LOCAL-STORAGE SECTION.
          01 HELLO-WORLD PIC X(9) VALUE 10 .
       LINKAGE SECTION.
          01 A PIC 9(9) VALUE 10 .


       PROCEDURE DIVISION.